app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save # => Validation
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Foo Bar"], ["email", "foo@bar.com"], ["updated_at", "2019-02-18 11:29:48.961056"], ["id", 762146111]]